In [1]:
import pandas as pd

In [9]:
s1=pd.Series([100,200,300,400])
s1

0    100
1    200
2    300
3    400
dtype: int64

In [22]:
s1=pd.Series([100,200,300,400], index=("a","b","c","d"))
s1

a    100
b    200
c    300
d    400
dtype: int64

In [12]:
s1=pd.Series([100,200,300,400], index=("a","b","c","d"),name=("slaes of 4 days"))
s1

a    100
b    200
c    300
d    400
Name: slaes of 4 days, dtype: int64

In [13]:
s1.values

array([100, 200, 300, 400])

In [14]:
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [15]:
s1.name

'slaes of 4 days'

## create a pandas series to store a canten data that how much sandwithes sales per day (in a week)

In [24]:
canten_sales=pd.Series([50,40,60,55,80,70,0],
                       index=["Mon","Tue","Wed","Thu","Fri","Sat","Sun"])
canten_sales.name="sales per week"
canten_sales

Mon    50
Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Sun     0
Name: sales per week, dtype: int64

In [25]:
canten_sales[3]

55

In [26]:
canten_sales["Mon"]

50

In [27]:
canten_sales[[2,4]]

Wed    60
Fri    80
Name: sales per week, dtype: int64

In [28]:
canten_sales[canten_sales>50]

Wed    60
Thu    55
Fri    80
Sat    70
Name: sales per week, dtype: int64

In [29]:
canten_sales[(canten_sales>40)&(canten_sales<60)]

Mon    50
Thu    55
Name: sales per week, dtype: int64

In [30]:
canten_sales[1:-1]

Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Name: sales per week, dtype: int64

In [31]:
canten_sales=canten_sales*2

In [32]:
canten_sales

Mon    100
Tue     80
Wed    120
Thu    110
Fri    160
Sat    140
Sun      0
Name: sales per week, dtype: int64

In [37]:
canten_sales=canten_sales/2

In [38]:
canten_sales

Mon    25.0
Tue    20.0
Wed    30.0
Thu    27.5
Fri    40.0
Sat    35.0
Sun     0.0
Name: sales per week, dtype: float64

In [39]:
adic={501:"Hamza",502:"Abbas",503:"Nouman",504:"Safdar",505:"Kashan"}

In [40]:
ss=pd.Series(adic)

In [41]:
ss.values

array(['Hamza', 'Abbas', 'Nouman', 'Safdar', 'Kashan'], dtype=object)

In [42]:
ss.index

Int64Index([501, 502, 503, 504, 505], dtype='int64')

In [44]:
sa=pd.Series(adic,index=[504,503,505,501,502])

In [45]:
sa

504    Safdar
503    Nouman
505    Kashan
501     Hamza
502     Abbas
dtype: object

In [49]:
ss.name="students Series"

In [50]:
ss.name

'students Series'

In [51]:
sa=pd.Series(adic,index=[504,503,505,501,502,507])

In [53]:
sa.isnull()

504    False
503    False
505    False
501    False
502    False
507     True
dtype: bool

In [54]:
pd.isnull(sa)           #we can use both methods

504    False
503    False
505    False
501    False
502    False
507     True
dtype: bool

## Can we change index names??

In [55]:
canten_sales=pd.Series([50,40,60,55,80,70,0],
                       index=["Mon","Tue","Wed","Thu","Fri","Sat","Sun"])
canten_sales.name="sales per week"
canten_sales

Mon    50
Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Sun     0
Name: sales per week, dtype: int64

In [56]:
canten_sales.index

Index(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], dtype='object')

In [60]:
canten_sales.index=["m","t","w","t","f","s","s"]

In [61]:
canten_sales.index

Index(['m', 't', 'w', 't', 'f', 's', 's'], dtype='object')

In [63]:
canten_sales["t"]

t    40
t    55
Name: sales per week, dtype: int64

so yes we can change index names
if there are multiple values with same name of index it will extract all

In [64]:
canten_sales.index.name

In [65]:
canten_sales.index.name="sales index"

In [66]:
canten_sales.index.name

'sales index'

In [67]:
canten_sales

sales index
m    50
t    40
w    60
t    55
f    80
s    70
s     0
Name: sales per week, dtype: int64

#  DataFrames

In [68]:
import pandas as pd

In [69]:
apples=pd.Series([0,1,2,3])
oranges=pd.Series([1,2,3,4])
data={"apples":apples,"oranges":oranges}
fruit_df=pd.DataFrame(data)

In [70]:
fruit_df

   apples  oranges
0       0        1
1       1        2
2       2        3
3       3        4

In [2]:
import numpy as np

In [10]:
a=np.arange(100).reshape(10,10)
print(type(a))
s1=pd.Series([a])
print(type(s1))

<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>

In [11]:
df1=pd.DataFrame(a)

In [12]:
df1

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [14]:
column_names=[chr(i) for i in range(65,75)]
column_names

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [15]:
rows_names=[chr(i) for i in range(97,107)]
rows_names

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [16]:
df1.columns=column_names
df1.index=rows_names

In [17]:
df1

    A   B   C   D   E   F   G   H   I   J
a   0   1   2   3   4   5   6   7   8   9
b  10  11  12  13  14  15  16  17  18  19
c  20  21  22  23  24  25  26  27  28  29
d  30  31  32  33  34  35  36  37  38  39
e  40  41  42  43  44  45  46  47  48  49
f  50  51  52  53  54  55  56  57  58  59
g  60  61  62  63  64  65  66  67  68  69
h  70  71  72  73  74  75  76  77  78  79
i  80  81  82  83  84  85  86  87  88  89
j  90  91  92  93  94  95  96  97  98  99

In [18]:
df1.H

a     7
b    17
c    27
d    37
e    47
f    57
g    67
h    77
i    87
j    97
Name: H, dtype: int64

In [19]:
df1.D=5

In [20]:
df1

    A   B   C  D   E   F   G   H   I   J
a   0   1   2  5   4   5   6   7   8   9
b  10  11  12  5  14  15  16  17  18  19
c  20  21  22  5  24  25  26  27  28  29
d  30  31  32  5  34  35  36  37  38  39
e  40  41  42  5  44  45  46  47  48  49
f  50  51  52  5  54  55  56  57  58  59
g  60  61  62  5  64  65  66  67  68  69
h  70  71  72  5  74  75  76  77  78  79
i  80  81  82  5  84  85  86  87  88  89
j  90  91  92  5  94  95  96  97  98  99

In [21]:
df1.O=4

In [22]:
df1

    A   B   C  D   E   F   G   H   I   J
a   0   1   2  5   4   5   6   7   8   9
b  10  11  12  5  14  15  16  17  18  19
c  20  21  22  5  24  25  26  27  28  29
d  30  31  32  5  34  35  36  37  38  39
e  40  41  42  5  44  45  46  47  48  49
f  50  51  52  5  54  55  56  57  58  59
g  60  61  62  5  64  65  66  67  68  69
h  70  71  72  5  74  75  76  77  78  79
i  80  81  82  5  84  85  86  87  88  89
j  90  91  92  5  94  95  96  97  98  99

In [23]:
df1["O"]=2

In [24]:
df1

    A   B   C  D   E   F   G   H   I   J  O
a   0   1   2  5   4   5   6   7   8   9  2
b  10  11  12  5  14  15  16  17  18  19  2
c  20  21  22  5  24  25  26  27  28  29  2
d  30  31  32  5  34  35  36  37  38  39  2
e  40  41  42  5  44  45  46  47  48  49  2
f  50  51  52  5  54  55  56  57  58  59  2
g  60  61  62  5  64  65  66  67  68  69  2
h  70  71  72  5  74  75  76  77  78  79  2
i  80  81  82  5  84  85  86  87  88  89  2
j  90  91  92  5  94  95  96  97  98  99  2

In [28]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [37]:
obj4=pd.Series(sdata,index=states)

In [38]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [41]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [42]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [45]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [46]:
obj4.name = 'population'

In [47]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [48]:
obj4.index.name="States"

In [49]:
obj4

States
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
df1

    A   B   C  D   E   F   G   H   I   J  O
a   0   1   2  5   4   5   6   7   8   9  2
b  10  11  12  5  14  15  16  17  18  19  2
c  20  21  22  5  24  25  26  27  28  29  2
d  30  31  32  5  34  35  36  37  38  39  2
e  40  41  42  5  44  45  46  47  48  49  2
f  50  51  52  5  54  55  56  57  58  59  2
g  60  61  62  5  64  65  66  67  68  69  2
h  70  71  72  5  74  75  76  77  78  79  2
i  80  81  82  5  84  85  86  87  88  89  2
j  90  91  92  5  94  95  96  97  98  99  2

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     int64
 2   C       10 non-null     int64
 3   D       10 non-null     int64
 4   E       10 non-null     int64
 5   F       10 non-null     int64
 6   G       10 non-null     int64
 7   H       10 non-null     int64
 8   I       10 non-null     int64
 9   J       10 non-null     int64
 10  O       10 non-null     int64
dtypes: int64(11)
memory usage: 1.2+ KB

In [78]:
 df=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Qasim git repo/Sunday/1_30 to 3_30/data/train.csv")

In [79]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [81]:
df.PassengerId.notnull().all()

True

In [82]:
df.PassengerId.isnull().any()

False

In [83]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [84]:
df.Age.value_counts().head()

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: Age, dtype: int64

In [85]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [86]:
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [87]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [75]:
# df.columns=[chr(i) for i in range(65,77)]

In [77]:
df.head()

,A,B,C,D,E,F,G,H,I,J,K,L
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S